epoch_num = 100
train_image_size = (224, 224)
dataset_path = 'DATASET_car_type_color'
val_labels = 'val.csv'
train_labels = 'train.csv'
model_plot = True
pad_resize = False
batch_size = 16

color_label = {0: 'beige', 1: 'black', 2: 'blue', 3: 'gray', 4: 'red', 5: 'silver', 6: 'white', 7: 'orange',
               8: 'yellow', 9: 'brown', 10: 'green', 11: 'indigo', 12: 'darkolivgreen'}

type_label = {0: 'آلفارومئو', 1: 'ام-جی_MG-3', 2: 'ام-جی_MG-6', 3: 'ام-وی-ام', 4: 'ایران-خودرو_آریسان',
              5: 'ایران-خودرو_دنا', 6: 'ایران-خودرو_رانا', 7: 'ایران-خودرو_سمند', 8: 'ایران-خودرو_پیکان',
              9: 'ایران-خودرو_پیکان-وانت', 10: 'برلیانس_H220', 11: 'برلیانس_H320-H330', 12: 'بسترن_B30', 13: 'بنز',
              14: 'بهمن_وانت-کاپرا', 15: 'بی-ام-و', 16: 'تویوتا_CH-R', 17: 'تویوتا_راو-4', 18: 'تویوتا_لندکروزر',
              19: 'تویوتا_هایلوکس', 20: 'تویوتا_پرادو', 21: 'لیفان_520', 22: 'لیفان_820', 23: 'لیفان_X60',
              24: 'مرتب_پاژن', 25: 'مزدا_مزدا-3', 26: 'مزدا_مزدا-323', 27: 'مزدا_مزدا-وانت', 28: 'میتسوبیشی_لنسر',
              29: 'میتسوبیشی_ون-دلیکا', 30: 'میتسوبیشی_پاژرو', 31: 'میتسوبیشی_گالانت', 32: 'نیسان_جوک',
              33: 'نیسان_ماکسیما', 34: 'نیسان_نیسان-وانت', 35: 'نیسان_پاترول', 36: 'نیسان_پیکاپ', 37: 'هایما_S5',
              38: 'هایما_S7', 39: 'هیوندای_i20', 40: 'هیوندای_i30', 41: 'هیوندای_ix35', 42: 'هیوندای_ix55',
              43: 'هیوندای_آزرا', 44: 'هیوندای_آوانته', 45: 'هیوندای_النترا', 46: 'هیوندای_اکسنت', 47: 'هیوندای_توسان',
              48: 'هیوندای_جنسیس-سدان', 49: 'هیوندای_جنسیس-کوپه', 50: 'تویوتا_کمری', 51: 'جک_j3', 52: 'جک_j5',
              53: 'جک_S3', 54: 'جک_S5', 55: 'جیلی_امگرند-7', 56: 'جیپ', 57: 'دانگ-فنگ_H30', 58: 'دوو_اسپرو',
              59: 'دوو_سیلو', 60: 'دوو_ماتیز', 61: 'رنو_L90', 62: 'رنو_تالیسمان', 63: 'رنو_داستر', 64: 'رنو_ساندرو',
              65: 'رنو_مگان', 66: 'رنو_پی-کی', 67: 'رنو_کولیوس', 68: 'رنو_کپچر', 69: 'سانگ-یانگ_تیوولی',
              70: 'سایپا_آریو', 71: 'سایپا_تیبا', 72: 'سایپا_ساینا', 73: 'سایپا_پراید', 74: 'سوزوکی_گرند-ویتارا',
              75: 'سیتروئن_زانتیا', 76: 'فولکس-واگن_گل', 77: 'هیوندای_سوناتا', 78: 'هیوندای_ورنا', 79: 'هیوندای_ولستر',
              80: 'پروتون_جن-2', 81: 'پورشه', 82: 'پژو_2008', 83: 'پژو_206', 84: 'پژو_207', 85: 'پژو_405',
              86: 'پژو_پارس', 87: 'چانگان_CS35', 88: 'چری_آریزو-5', 89: 'چری_تیگو-5', 90: 'چری_تیگو-7',
              91: 'کیا_اسپورتیج', 92: 'کیا_اپتیما', 93: 'کیا_ریو', 94: 'کیا_سراتو', 95: 'کیا_سورنتو',
              96: 'کیا_موهاوی', 97: 'تویوتا_کرولا', 98: 'لکسوس', 99: 'هیوندای_سانتافه'}
